benchmark/leveldb/results/new-micro/mris_seq_wt_ssd.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:26:47 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    1696.534 micros/op;   39.2 MB/s
Microseconds per op:
Count: 20000  Average: 1696.1943  StdDev: 5470.30
Min: 115.0000  Median: 675.0605  Max: 222324.0000
------------------------------------------------------
[     100,     120 )     105   0.525%   0.525% 
[     120,     140 )    8397  41.985%  42.510% ########
[     140,     160 )     746   3.730%  46.240% #
[     160,     180 )     163   0.815%  47.055% 
[     180,     200 )     220   1.100%  48.155% 
[     200,     250 )      50   0.250%  48.405% 
[     250,     300 )       1   0.005%  48.410% 
[     300,     350 )       2   0.010%  48.420% 
[     350,     400 )       6   0.030%  48.450% 
[     600,     700 )     413   2.065%  50.515% 
[     700,     800 )    1069   5.345%  55.860% #
[     800,     900 )    3854  19.270%  75.130% ####
[     900,    1000 )     212   1.060%  76.190% 
[    1000,    1200 )     988   4.940%  81.130% #
[    1200,    1400 )     626   3.130%  84.260% #
[    1400,    1600 )     225   1.125%  85.385% 
[    1600,    1800 )      40   0.200%  85.585% 
[    1800,    2000 )      10   0.050%  85.635% 
[    2000,    2500 )      88   0.440%  86.075% 
[    2500,    3000 )      32   0.160%  86.235% 
[    3000,    3500 )      38   0.190%  86.425% 
[    3500,    4000 )      47   0.235%  86.660% 
[    4000,    4500 )     345   1.725%  88.385% 
[    4500,    5000 )    1135   5.675%  94.060% #
[    5000,    6000 )     667   3.335%  97.395% #
[    6000,    7000 )     121   0.605%  98.000% 
[    7000,    8000 )      66   0.330%  98.330% 
[    8000,    9000 )      10   0.050%  98.380% 
[    9000,   10000 )       2   0.010%  98.390% 
[   30000,   35000 )       4   0.020%  98.410% 
[   35000,   40000 )     105   0.525%  98.935% 
[   40000,   45000 )     201   1.005%  99.940% 
[   45000,   50000 )       6   0.030%  99.970% 
[   50000,   60000 )       4   0.020%  99.990% 
[   60000,   70000 )       1   0.005%  99.995% 
[  200000,  250000 )       1   0.005% 100.000%